#################################################################################
# NAME（名前）: Microsoft.PowerShell_profile.ps1
# SINOPSIS（サマリ）: User profile in Microsoft.PowerShell 
# SYNTAX（構文）: .\Microsoft.PowerShell_profile.ps1
#     $1 : -
#     $2 : -
#     EXAMPLE: .\Microsoft.PowerShell_profile.ps1
# DESCRIPTION（概要）:現在のユーザーと Microsoft.PowerShell シェルのみに適用
# 
# DATE（作成日）: 2020/06/01
# UPDATE DATE（更新日）: 2025/05/28
# CHANGE LOG（更新履歴）: 
# 2021/02/06: バックアップディレクトリ（bk）作成
# 2021/02/07: PSReadlineKeyHandler設定
# 2021/02/07: powershell.csv設定
# 2021/02/13: function.ps1設定
# 2021/03/05: env.ps1設定
# 2021/03/12: readfile.ps1設定
# 2021/03/12: dirdefinition.ps1設定
# 2021/03/20: Transcript.ps1設定
# 2021/03/20: PSReadlineKeyHandler.ps1設定
# 2021/03/20: console.ps1設定
# 2025/05/28: DH-WK変更
# MAKER（作者）: DH
#################################################################################

#################################################################################
#                     ディレクトリ定義・作成               　　　　　　　　　　
#################################################################################

# ベースディレクトリ定義

# ログオンスクリプトディレクトリ定義
$LscriptFolder = (Split-Path -Parent $profile)

# DH-WKディレクトリ定義
$DHWK_BASE = (Join-Path $LscriptFolder DH-WK)

# スクリプトディレクトリ定義
$ScriptFolder = (Join-Path $DHWK_BASE bin)

# その他のディレクトリ定義・作成
. $ScriptFolder\.dirdefinition.ps1

#################################################################################
#                     関数定義               　　　　　　　　　　
#################################################################################

. $ScriptFolder\.function.ps1

#################################################################################
#                     環境変数定義               　　　　　　　　　　
#################################################################################

. $ScriptFolder\.env.ps1

#################################################################################
#                     読み込みファイル定義               　　　　　　　　　　
#################################################################################

. $ScriptFolder\.readfile.ps1

#################################################################################
#                     PSReadlineKeyHandler設定          　　　　　　　　　　　　　　　    
#################################################################################

. $ScriptFolder\.PSReadlineKeyHandler.ps1

#################################################################################
#                     Transcript開始          　　　　　　　　　　　　　　　    
#################################################################################

. $ScriptFolder\.Transcript.ps1

#################################################################################
#                     コンソール定義                                            
#################################################################################

. $ScriptFolder\.console.ps1
